<?php
//====================================================================
// ●：5-5 Smarty 表示
//====================================================================
//--------------------------------------
// □ Smartyクラスを読み込み
//--------------------------------------
require_once("Smarty/Smarty.class.php");
//--------------------------------------
// □ Smartyクラスのインスタンスの作成
//--------------------------------------
$smarty = new Smarty;
//--------------------------------------
// □ Smartyクラスの変数に値を設定
//--------------------------------------
/*
$path = getcwd();
$smarty->template_dir = "{$path}/templates";
$smarty->config_dir = "{$path}/config";
$smarty->cache_dir = "{$path}/cache";
$smarty->compile_dir = "{$path}/templates_c";
*/
//--------------------------------------
// □ テンプレートに値を割り当てます。
//--------------------------------------
$smarty->assign("name","まさご");
//--------------------------------------
// □ テンプレートをブラウザに出力
//--------------------------------------
$smarty->display("5-5-2.tpl");
?>
