<?php
//====================================================================
// ●：5-5 Smartyを使ったテーブル出力
//====================================================================
//--------------------------------------
// □ Smartyクラスを読み込み
//--------------------------------------
require_once("Smarty/Smarty.class.php");
//--------------------------------------
// □ Smartyクラスのインスタンスの作成
//--------------------------------------
$smarty = new Smarty;
//---------------------------------------
// □ タイトルと表を時間により作成
//---------------------------------------
if (date("H")>12){
	$title = "動物リスト";
	$data =array("ネコ","イヌ","パンダ","ウサギ","キリン","ゾウ");
}else{
	$title = "果物リスト";
	$data =array("イチゴ","みかん","リンゴ","バナナ","パイナップル","メロン");
}
$ymdhis=date("Y/m/d H:i:s");
//---------------------------------------
// □ テンプレートに値の割り当て
//---------------------------------------
$smarty->assign("title",$title);
$smarty->assign("data",$data);
$smarty->assign("ymdhis",$ymdhis);
//--------------------------------------
// □ テンプレートをブラウザに出力
//--------------------------------------
$smarty->display("5-5-4.tpl");
?>
