<?php
//====================================================================
// ●：5-5 Smarty　を使わないテーブル出力
//====================================================================
?>
<html>
<head>
<meta http-equiv="Content-type" content="text/html; charset=utf-8">
<title>Smartyを使わないテーブル出力</title>
</head>
<body>
<?php
//---------------------------------------
// □ タイトルと表を時間により作成
//---------------------------------------
if (date("H")>12){
	$title = "動物リスト";
	$data =array("ネコ","イヌ","パンダ","ウサギ","キリン","ゾウ");
}else{
	$title = "果物リスト";
	$data =array("イチゴ","みかん","リンゴ","バナナ","パイナップル","メロン");

}
?>
<br>
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *<br>
<?php
//---------------------------------------
// □ タイトル表示
//---------------------------------------
echo "$title<br>\n";
?>
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *<br>
<br>
<table border="1">
<?php
//---------------------------------------
// □ テーブル出力
//---------------------------------------
foreach($data as $key => $value) {
	echo "<tr>\n";
	echo "<td><font size=\"2\">$key</font></td>\n";
	echo "<td>$value</td>\n";
	echo "</tr>\n";
}
?>
</table>
<br><br>
- - - - - - - - - - - - - - - - - - - - - - - - - - - -<br>
<?php
//---------------------------------------
// □ 現在時刻を表示
//---------------------------------------
echo date("Y/m/d H:i:s") ."作成";
?>
</body>
</html>
